
/* Strings for login panel. See Keychain.cpp. */

"kLoginTitle" = "Inserisci il nome utente e la password per accedere al feed RSS.";
"kLoginInitialMessage"      = "Per accedere al feed RSS \"%@\", devi accedere all'area \"%@\" su %@. La password verrà inviata come testo non codificato.\n";
"kLoginFailedMessage"       = "Login fallito. Inserisci nuovamente il nome utente e la password per l'area \"%@\" su %@.\n";
"kLoginUsernameField"       = "Nome:";
"kLoginPasswordField"       = "Password:";
"kLoginLogInButton"         = "Login";
"kLoginCancelButton"        = "Annulla";
"kLoginSavePasswordCheckbox"= "Aggiungi questa password al portachiavi";


/* Error Messages */

"PSInternalErrorDescription"        = "Si è verificato un errore interno al framework Sottoscrizione pubblicazione.";
"PSInternalErrorFailureReason"      = "Si è verificato un errore interno al framework Sottoscrizione pubblicazione.";
"PSInternalErrorRecoverySuggestion" = "Esegui il logout e riprova.";

"PSNotAFeedErrorDescription"        = "Impossibile caricare il feed poiché il formato del contenuto è sconosciuto.";
"PSNotAFeedErrorFailureReason"      = "Il formato del contenuto è sconosciuto.";
"PSNotAFeedErrorRecoverySuggestion" = "Verifica che il percorso specificato contenga un feed nel formato Atom o RSS.";

"NSURLErrorUserAuthenticationRequired Description" = "Sono necessari un nome utente e una password";

/* Localized date/time formats. See DateClass.cpp */

"TodayFmt"      = "'Oggi', h:mm a";
"YesterdayFmt"  = "'Ieri', h:mm a";
"ThisWeekFmt"   = "EEEE, h:mm a";
"ThisYearFmt"   = "d MMM, h:mm a";
"PastYearFmt"   = "d MMM, ''yy, h:mm a";

/* Localizable file size formatters.  See StringClass::representationForBytes */

"0 bytes"            = "0 byte";           /* String used for showing a zero byte size */
"1 byte"             = "1 byte";            /* String used for showing a one byte size */
"%.0f bytes"         = "%.0f byte";        /* Format used to display a size between 2 and 100 bytes */
"%.1f KB (0.1)"      = "%.1f KB";           /* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (1.0)"      = "%.1f KB";           /* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (10.0)"     = "%.1f KB";           /* Format used to display sizes between 10 and 99.9 KB */
"%.0f KB"            = "%.0f KB";           /* Format used to display sizes between 100 and 999 KB */
"%.1f MB (1.0)"      = "%.1f MB";           /* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (10.0)"     = "%.1f MB";           /* Format used to display sizes between 10 and 99.9 MB */
"%.0f MB"            = "%.0f MB";           /* Format used to display sizes between 100 and 999 MB */
"%.1f GB (1.0)"      = "%.2f GB";           /* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (10.0)"     = "%.2f GB";           /* Format used to display sizes between 10 and 99.9 GB */
"%.0f GB"            = "%.0f GB";           /* Format used to display sizes 100 GB or greater */

/* Localizable file names. Currently only used in EnclosureCore.cpp */

"kUntitledFileName" = "Senza titolo";   /* If we download and enclosure for which we have no other name to go by */
